[
    {
        "icon": null,
        "title": "Built on AsnycIO",
        "body": "TBone is a concurent web framework, build on top of AsyncIO. It is ideal for developing real-time APIs and services which rely on heavy IO-bound operations"
    },
    {
        "icon": null,
        "title": "Web server agnostic",
        "body": "TBone is a concurrent web framework built on top of AsyncIO. It can work with any Python server that is built on AsyncIO. TBone comes with full support for Sanic and AioHttp and can easily be extended to support other servers"
    },
    {
        "icon": null,
        "title": "Full-duplex RESTful APIs",
        "body": "Build REST-style resources that provide real-time communication between server and client. TBone implements an abstraction layer that is protocol agnostic and allows developers to build RESTful resources even when not working with HTTP"
    },
    {
        "icon": null,
        "title": "Data management. An ODM layer for representing data schema",
        "body": "TBone comes with a full object mapper so developers can write Python classes that represent data and have full control over data serialization and de-serialization"
    },
    {
        "icon": null,
        "title": "Data Persistency",
        "body": "TBone's data management classes are datastore agnostic. TBone ships with a full implementation of data persistency over MongoDB"
    },
    {
        "icon": null,
        "title": "HTTP and websocket protocols",
        "body": "REST resources are protocol agnostic. TBone provides full support for HTTP and websocket protocols. TBone can easily be extended to support other protocols such as AMQP"
    },
    {
        "icon": null,
        "title": "Authentication and Authorization",
        "body": "Full support for user authentication and authorization using server-side sessions as well as JWT tokens"
    },
    {
        "icon": null,
        "title": "JavaScript Client Library for Web and Mobile",
        "body": "TBone ships with a vanilla-based Javascript library which makes it easy to write client for web and mobile"
    },{
        "icon": null,
        "title": "Factory app for scaffolding projects in minutes",
        "body": "TBone ships with an optional factory CLI that will generate and scaffold your TBone apps and services based on your requirements"
    }
]